# Operations

In [4]:
import pandas as pd

df = pd.DataFrame(
    data = {
        'A': [1,2,3,4,5],
        'B': [1111,2222,3333,2222,1111],
        'C': ['abc','def','ghi','jkl','mno']
    })

df

# we can see some duplicate values in Col 'B'.

   A     B    C
0  1  1111  abc
1  2  2222  def
2  3  3333  ghi
3  4  2222  jkl
4  5  1111  mno

In [6]:
## Example on Unique values.

df['A'].unique()  # In Col 'A' no duplicate values.

array([1, 2, 3, 4, 5])

In [8]:
df['B'].unique() # Duplicate values are removed.

array([1111, 2222, 3333])

In [10]:
df['B'].nunique() # this will return count of unique values.

3

In [12]:
df['B'].value_counts() # this will return count of each unique values.

B
1111    2
2222    2
3333    1
Name: count, dtype: int64

In [13]:
df['B'].sum()

np.int64(9999)

## Custom Functions

In [16]:
# Function Defination

def times2(value):
    return value * 2

In [17]:
# Function calling

result = times2(100)

print(result)

200

In [20]:
# apply function.

df['B'].apply(times2)

# The apply function will apply the times2 function on each row of 'B' col.

0    2222
1    4444
2    6666
3    4444
4    2222
Name: B, dtype: int64

In [26]:
# using built in functions like len, sum, max, min, ....

df['C'].apply(len)

0    3
1    3
2    3
3    3
4    3
Name: C, dtype: int64

## Lambda Functions

In [27]:
df['B'].apply(lambda number:number*5)

0     5555
1    11110
2    16665
3    11110
4     5555
Name: B, dtype: int64

In [28]:
df['C'].apply(lambda string : string * 2)

0    abcabc
1    defdef
2    ghighi
3    jkljkl
4    mnomno
Name: C, dtype: object

In [29]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
# Sorting Column

df.sort_values(by='B')

   A     B    C
0  1  1111  abc
4  5  1111  mno
1  2  2222  def
3  4  2222  jkl
2  3  3333  ghi

In [36]:
df.isnull()  # will check the cell is null, if not it will return False.

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False